Revit 2026 API

# PreferredJunctionType Enumeration

---

Enumerated type representing the possible options for the preferred junction for a routine preference rule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PreferredJunctionType
```
```vb
Public Enumeration PreferredJunctionType
```
```cpp
public enum class PreferredJunctionType
```
```fsharp
type PreferredJunctionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Tap | 1 | Tap junction type. |
| Tee | 0 | Tee junction type. |

#### Reference

Autodesk.Revit.DB Namespace